In [1]:
import pandas as pd

In [4]:
df = pd.read_csv("excercise.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
inputs = df[['Survived', 'Pclass', 'Sex', 'Age']]
inputs

     Survived  Pclass     Sex   Age
0           0       3    male  22.0
1           1       1  female  38.0
2           1       3  female  26.0
3           1       1  female  35.0
4           0       3    male  35.0
..        ...     ...     ...   ...
886         0       2    male  27.0
887         1       1  female  19.0
888         0       3  female   NaN
889         1       1    male  26.0
890         0       3    male  32.0

[891 rows x 4 columns]

In [11]:
from sklearn.preprocessing import LabelEncoder

In [12]:
sex_encoded = LabelEncoder()

In [13]:
inputs['sex_encoded'] = sex_encoded.fit_transform(inputs['Sex'])
inputs.head()

C:\Users\ASUS\anaconda3\envs\tensor_gpu\lib\site-packages\pandas\core\frame.py:3607: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._set_item(key, value)

   Survived  Pclass     Sex   Age  sex_encoded
0         0       3    male  22.0            1
1         1       1  female  38.0            0
2         1       3  female  26.0            0
3         1       1  female  35.0            0
4         0       3    male  35.0            1

In [16]:
inputs.drop(['Sex'], axis=1, inplace=True)
inputs

C:\Users\ASUS\anaconda3\envs\tensor_gpu\lib\site-packages\pandas\core\frame.py:4908: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

     Survived  Pclass   Age  sex_encoded
0           0       3  22.0            1
1           1       1  38.0            0
2           1       3  26.0            0
3           1       1  35.0            0
4           0       3  35.0            1
..        ...     ...   ...          ...
886         0       2  27.0            1
887         1       1  19.0            0
888         0       3   NaN            0
889         1       1  26.0            1
890         0       3  32.0            1

[891 rows x 4 columns]

In [18]:
inputs['Age'].isna().sum()

177

In [23]:
int(inputs['Age'].mean())

29

In [25]:
inputs['Age'].fillna(int(inputs['Age'].mean()), inplace=True)
inputs

C:\Users\ASUS\anaconda3\envs\tensor_gpu\lib\site-packages\pandas\core\generic.py:6383: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return self._update_inplace(result)

     Survived  Pclass   Age  sex_encoded
0           0       3  22.0            1
1           1       1  38.0            0
2           1       3  26.0            0
3           1       1  35.0            0
4           0       3  35.0            1
..        ...     ...   ...          ...
886         0       2  27.0            1
887         1       1  19.0            0
888         0       3  29.0            0
889         1       1  26.0            1
890         0       3  32.0            1

[891 rows x 4 columns]

In [26]:
inputs.isna().sum()

Survived       0
Pclass         0
Age            0
sex_encoded    0
dtype: int64

In [27]:
target = inputs['Survived']
inputs.drop(['Survived'], axis=1, inplace=True)
target

C:\Users\ASUS\anaconda3\envs\tensor_gpu\lib\site-packages\pandas\core\frame.py:4908: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [28]:
from sklearn import tree

In [29]:
model = tree.DecisionTreeClassifier()

In [30]:
model.fit(inputs, target)

DecisionTreeClassifier()

In [31]:
model.score(inputs, target)

0.8787878787878788

In [37]:
model.predict([[1, 22, 0]])

array([1], dtype=int64)